-- phpMyAdmin SQL Dump
-- version 4.8.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Июл 04 2018 г., 00:43
-- Версия сервера: 10.1.31-MariaDB
-- Версия PHP: 7.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `tgc1_users`
--

-- --------------------------------------------------------

--
-- Структура таблицы `profit_center`
--

CREATE TABLE `profit_center` (
  `id` int(11) NOT NULL,
  `code` varchar(4) NOT NULL,
  `description` varchar(40) NOT NULL,
  `short_desc` varchar(20) NOT NULL,
  `bookedOn` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `isValid` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Profit Centers for SAP ERP';

--
-- Дамп данных таблицы `profit_center`
--

INSERT INTO `profit_center` (`id`, `code`, `description`, `short_desc`, `bookedOn`, `isValid`) VALUES
(1, 'D100', 'Управление ПАО ТГК-1', 'Управление ПАО ТГК-1', '2018-07-01 11:08:45', 1),
(2, 'D200', 'Управление Невский филиал', 'Апп.управ.Невский', '2018-07-01 11:11:24', 1),
(3, 'D202', 'ЦТЭЦ 2 Центральная', 'ЦТЭЦ 2 Центральная', '2018-07-01 11:08:45', 1),
(4, 'D205', 'ТЭЦ 5 Правобережная', 'ТЭЦ 5 Правобережная', '2018-07-01 11:08:45', 1),
(5, 'D207', 'ТЭЦ 7 Василеостровская', 'ТЭЦ 7 Василеостровск', '2018-07-01 11:08:45', 1),
(6, 'D208', 'ТЭЦ 8 Дубровская', 'ТЭЦ 8 Дубровская', '2018-07-01 11:08:45', 1),
(7, 'D213', 'ГЭС 13 Нарвская', 'ГЭС 13 Нарвская', '2018-07-01 11:08:45', 1),
(8, 'D214', 'ТЭЦ 14 Первомайская', 'ТЭЦ 14 Первомайская', '2018-07-01 11:08:45', 1),
(9, 'D215', 'ТЭЦ 15 Автовская', 'ТЭЦ 15 Автовская', '2018-07-01 11:08:45', 1),
(10, 'D217', 'ТЭЦ 17 Выборгская', 'ТЭЦ 17 Выборгская', '2018-07-01 11:08:45', 1),
(11, 'D220', 'Каскад Ладожских ГЭС', 'Каскад Ладожских ГЭС', '2018-07-01 11:08:45', 1),
(12, 'D221', 'ТЭЦ 21 Северная', 'ТЭЦ 21 Северная', '2018-07-01 11:08:45', 1),
(13, 'D222', 'ТЭЦ 22 Южная', 'ТЭЦ 22 Южная', '2018-07-01 11:08:45', 1),
(14, 'D230', 'Каскад Вуоксинских ГЭС', 'Каскад Вуоксинских Г', '2018-07-01 11:08:45', 1),
(15, 'D291', 'Предприятие СДТУиИТ', 'Предприятие СДТУиИТ', '2018-07-01 11:08:45', 1),
(16, 'D300', 'Упр.фил. Карельский', 'Упр.фил. Карельский', '2018-07-01 11:08:45', 1),
(17, 'D330', 'ВыгскихГЭС', 'ВыгскихГЭС', '2018-07-01 11:08:45', 1),
(18, 'D340', 'Кемск.ГЭС', 'Кемск.ГЭС', '2018-07-01 11:08:45', 1),
(19, 'D350', 'Сунск.ГЭС', 'Сунск.ГЭС', '2018-07-01 11:08:45', 1),
(20, 'D361', 'Петрозав.ТЭЦ', 'Петрозав.ТЭЦ', '2018-07-01 11:08:45', 1),
(21, 'D370', 'Прионежский район', 'Прионежский район', '2018-07-01 11:08:45', 1),
(22, 'D380', 'Пряжинский район', 'Пряжинский район', '2018-07-01 11:08:45', 1),
(23, 'D400', 'Кольский', 'Кольский', '2018-07-01 11:08:45', 1),
(24, 'D420', 'Каскад Нивских ГЭС', 'Каскад Нивских ГЭС', '2018-07-01 11:08:45', 1),
(25, 'D430', 'Каскад Пазских ГЭС', 'Каскад Пазских ГЭС', '2018-07-01 11:08:45', 1),
(26, 'D440', 'Каскад ТуломскСерГЭС', 'Каскад ТуломскСерГЭС', '2018-07-01 11:08:45', 1),
(27, 'D461', 'Апатитская ТЭЦ', 'Апатитская ТЭЦ', '2018-07-01 11:08:45', 1),
(28, 'T001', 'Техническое ПФМ', 'Техническое ПФМ', '2018-07-01 11:08:45', 1),
(29, 'T002', 'Техническое ПФМ - 2', 'Техническое ПФМ - 2', '2018-07-01 11:08:45', 1);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `profit_center`
--
ALTER TABLE `profit_center`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `profit_center`
--
ALTER TABLE `profit_center`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=30;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
